Workspace/OpenFOAM-plus-OpenFOAM-v1812/tutorials/combustion/reactingFoam/RAS/chockedNozzle/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volScalarField;
    location        "0";
    object          k;
}

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 1;

boundaryField
{
    inletair
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.02;
        value           uniform 1;
    }
    outlet
    {
        type            zeroGradient;//inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    walls
    {
        type            kqRWallFunction;
        value           uniform 1;
    }
}


// ************************************************************************* //
